tests/jmeter/html_report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 120,
    "errorCount" : 60,
    "errorPct" : 50.0,
    "meanResTime" : 77.6,
    "medianResTime" : 57.0,
    "minResTime" : 35.0,
    "maxResTime" : 688.0,
    "pct1ResTime" : 133.40000000000003,
    "pct2ResTime" : 157.74999999999994,
    "pct3ResTime" : 657.1299999999989,
    "throughput" : 1.6126864668727323,
    "receivedKBytesPerSec" : 5.16992791207499,
    "sentKBytesPerSec" : 0.6160441304932133
  },
  "HTTP Request to /admin/authentication" : {
    "transaction" : "HTTP Request to /admin/authentication",
    "sampleCount" : 120,
    "errorCount" : 60,
    "errorPct" : 50.0,
    "meanResTime" : 77.6,
    "medianResTime" : 57.0,
    "minResTime" : 35.0,
    "maxResTime" : 688.0,
    "pct1ResTime" : 133.40000000000003,
    "pct2ResTime" : 157.74999999999994,
    "pct3ResTime" : 657.1299999999989,
    "throughput" : 1.6126864668727323,
    "receivedKBytesPerSec" : 5.16992791207499,
    "sentKBytesPerSec" : 0.6160441304932133
  }
}